Revit 2026 API

# IFCDataAsBoolean Method

---

Gets storage value as boolean when its PrimitiveType is boolean.

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool AsBoolean()
```
```vb
Public Function AsBoolean As Boolean
```
```cpp
public:
bool AsBoolean()
```
```fsharp
member AsBoolean : unit -> bool
```

#### Return Value

Boolean The bool value.

| Exception | Condition |
| --- | --- |
| InapplicableDataException | The primitive type is not boolean. |

#### Reference

IFCData Class

Autodesk.Revit.DB.IFC Namespace